Revit 2027 API
LoadedFamilyIntegrityCheck.CheckFamily Method
 Check that the loaded family has its content document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckFamily(
	Document ADoc,
	ElementId familyId
)
Public Shared Function CheckFamily (
	ADoc As Document,
	familyId As ElementId
) As Boolean
public:
static bool CheckFamily(
	Document^ ADoc,
	ElementId^ familyId
)
static member CheckFamily :
        ADoc : Document *
        familyId : ElementId -> bool
Parameters
ADoc Document
 The host document.
familyId ElementId
 The id of the family to check.
Return Value
Boolean
 Returns true if the family has its content document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace